---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Rebar..::..CreateFromCurves Method
Rebar Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateFromCurves(Document, RebarStyle, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList<(Of <<'(Curve>)>>), RebarHookOrientation, RebarHookOrientation, Boolean, Boolean) | Creates a new instance of a shape driven Rebar element within the project. |
|  | CreateFromCurves(Document, RebarStyle, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList<(Of <<'(Curve>)>>), RebarHookOrientation, RebarHookOrientation, Double, Double, ElementId, ElementId, Boolean, Boolean) | Creates a new instance of a shape driven Rebar element within the project. |

# See Also

Rebar Class

Rebar Members

Autodesk.Revit.DB.Structure Namespace